/*Напишите программу, которая принимает на вход
трёхзначное число и на выходе показывает последнюю цифру
этого числа.*/

Console.WriteLine("Write a tree-digit number a: ");
Console.WriteLine(int.Parse(Console.ReadLine())%10);